[
    {
        "title": "Software Engineer, Games (New Grad)",
        "company": "Peak",
        "location": "Istanbul",
        "date_posted_text": "Yeniden yayınlandı 1 gün önce",
        "applicants": "100+ kişi Başvur’u tıkladı İşe alım uzmanı tarafından tanıtılıyor",
        "easy_apply": false,
        "apply_link": "https://peak.com/open-positions/software-engineer-games-new-grad",
        "description_snippet": "İş ilanı hakkındaWe are looking for a recent graduate Software Engineer to join our Engineering Team. Together with your team, you will be crafting code that brings to life game features, items and le...",
        "description": "İş ilanı hakkındaWe are looking for a recent graduate Software Engineer to join our Engineering Team. Together with your team, you will be crafting code that brings to life game features, items and levels in our games which are enjoyed by a community of over 40 million monthly active players. This scale comes along with very interesting engineering challenges which we solve together, using a technology-agnostic approach. Alongside with our games, we continue to grow as software engineers and as a team.Here’s what you'll doBuild an amazing experience for the millions of users who play every dayDesign, implement, test and maintain our casual gaming productsWrite clean, sustainable code and participate in peer code-reviewsYou will have ownership of a primary work stream, which you will own end-to-end, but you'll also work in close collaboration with your fellow mobile engineersBrainstorm new ideas together with your team to continuously iterate and improve our games' user experienceDesired skills and experiencesUniversity degree in Computer Science, Software Engineering, or any equivalent subjectHaving game projects in Unity is an advantageThere’s no need to have prior game development experience. If you are an engineer and value a holistic and technology-agnostic approach to software engineering, we’d like to hear from you!What you’ll learn in this roleHow to develop, release and maintain high quality codeStrong engineering skills and programming fundamentalsA good command of various programming languages (such as C#, Java) and hands-on experience of best practices and idioms of these languagesSoftware architecture design, OOP, and design patterns and principles on various scalesWorking at PeakFast-paced environment with a tight-knit and collaborative cultureNever-ending learning and development opportunitiesRelevant conferences abroad to stay up to date with the latest industry trendsTeam events and tripsWe support your personal and professional development with challenging projects and regular feedbackFull health benefits",
        "job_url": "https://www.linkedin.com/jobs/search/?currentJobId=4227285827&f_E=2%2C3&f_TPR=r604800&keywords=Software%20Engineer&location=Istanbul",
        "scraped_at": "2025-12-09 14:57:49"
    }
]